python_fun.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-11-16 Tue 15:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python - Function</title>
<meta name="author" content="shaka" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="default.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Python - Function</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7e11a0e">参数</a>
<ul>
<li><a href="#orgb6b0ea7">Parameter</a>
<ul>
<li><a href="#org2c43a6d">变长参数(variable-length)</a></li>
<li><a href="#orgac6ed37">默认参数（可选参数）</a></li>
</ul>
</li>
<li><a href="#org7a617c8">Argument</a>
<ul>
<li><a href="#orgb64154d">位置参数</a></li>
<li><a href="#orgea5c94c">关键字参数</a></li>
<li><a href="#orga584f9a">调用方式的限制</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc5ab460">Docstring</a></li>
<li><a href="#orgb7ebc03">返回值</a></li>
</ul>
</div>
</div>
<p>
在Python中，函数通过关键字 <code>def</code> 定义。
</p>
<div id="outline-container-org7e11a0e" class="outline-2">
<h2 id="org7e11a0e">参数</h2>
<div class="outline-text-2" id="text-org7e11a0e">
<p>
从函数的角度，parameter指函数定义圆括号内的变量列表，而argument指当函数被调用时传递的值。
</p>
</div>
<div id="outline-container-orgb6b0ea7" class="outline-3">
<h3 id="orgb6b0ea7">Parameter</h3>
<div class="outline-text-3" id="text-orgb6b0ea7">
</div>
<div id="outline-container-org2c43a6d" class="outline-4">
<h4 id="org2c43a6d">变长参数(variable-length)</h4>
<div class="outline-text-4" id="text-org2c43a6d">
<ul class="org-ul">
<li>参数名前加 <code>*</code> 可以表示该参数可以接受任意数目的位置参数。这种情况下，函数会接受元组参数(a tuple of arguments)。以 <code>*</code> 开头的参数只能以最后一个位置参数的形式出现。</li>
<li>参数名前加 <code>**</code> 可以表示该参数可以接受任意数目的关键字参数。这种情况下，函数会接受元组参数(a tuple of arguments)。以 <code>**</code> 开头的参数只能以最后一个参数的形式出现。</li>
</ul>
</div>
</div>
<div id="outline-container-orgac6ed37" class="outline-4">
<h4 id="orgac6ed37">默认参数（可选参数）</h4>
<div class="outline-text-4" id="text-orgac6ed37">
<ul class="org-ul">
<li>可以在函数定义时，为参数指定默认值。</li>
<li>值得注意的是，默认值生效是在函数定义的时候，而不是在函数调用的时候。</li>
<li>一旦某个参数有默认值，那么后续所有参数都必须有默认值。为此，需要把有默认值的参数放在没有默认值的参数后面。</li>
<li>参数默认值应该重视不可变的对象，比如 <code>None</code>, <code>True</code>, <code>False</code>, 数字或者字符串。</li>
<li>如果默认值是可变容器的话，比如列表、集合或者字典，应该把 <code>None</code> 作为默认值，并在函数体内增加对默认值的检查。</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7a617c8" class="outline-3">
<h3 id="org7a617c8">Argument</h3>
<div class="outline-text-3" id="text-org7a617c8">
<p>
函数调用时的参数可以分为位置参数(positional argument)和关键字参数(keyword argument)。
</p>
</div>
<div id="outline-container-orgb64154d" class="outline-4">
<h4 id="orgb64154d">位置参数</h4>
<div class="outline-text-4" id="text-orgb64154d">
<ul class="org-ul">
<li>位置参数按照调用顺序为对应的参数赋值。</li>
</ul>
</div>
</div>
<div id="outline-container-orgea5c94c" class="outline-4">
<h4 id="orgea5c94c">关键字参数</h4>
<div class="outline-text-4" id="text-orgea5c94c">
<ul class="org-ul">
<li>关键字参数的调用方式为 <code>kwarg=value</code> 。</li>
<li>函数调用时，关键字参数的顺序可以是任意的。</li>
<li>关键字参数必须放在位置参数之后。</li>
</ul>
</div>
</div>
<div id="outline-container-orga584f9a" class="outline-4">
<h4 id="orga584f9a">调用方式的限制</h4>
<div class="outline-text-4" id="text-orga584f9a">
<div class="org-src-container">
<pre class="src src-python">def fn(positional_only1, positional_only2, /, positional_or_keyword1, positional_or_keyword2, *, keyword_only1, keyword_only2):
</pre>
</div>
<ul class="org-ul">
<li>如果 <code>/</code> 和 <code>*</code> 都没有，那么函数调用时参数赋值既可以是以位置参数的方式，也可以是关键字参数的方式。</li>
<li><code>/</code> 之前的参数赋值必须以位置参数的形式。</li>
<li><code>*</code> 之后的参数赋值必须以关键字参数的形式。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc5ab460" class="outline-2">
<h2 id="orgc5ab460">Docstring</h2>
<div class="outline-text-2" id="text-orgc5ab460">
<p>
对函数功能以及参数的描述。
</p>
</div>
</div>
<div id="outline-container-orgb7ebc03" class="outline-2">
<h2 id="orgb7ebc03">返回值</h2>
<div class="outline-text-2" id="text-orgb7ebc03">
<ul class="org-ul">
<li>有返回值的函数，通过关键字 <code>return</code> 返回。</li>
<li>没有返回值的函数会默认返回 <code>None</code> 。</li>
<li>如果需要返回多个值，可以返回一个元组(tuple<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>)。当调用的函数返回了元组，通常会将结果赋值给多个变量，也即元组解包。</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
元组是通过逗号组成的，而不是那些圆括号。
</p></div></div>


</div>
</div></div>
</body>
</html>
